<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"77cac56e41f3ade93310524831cabf62bfc599e0c2dacf5162c55e519f4345ae","plan_job_ref":"Job Environment Main - Plan #318 at https://github.com/jarrod-lowe/wildsea/actions/runs/11089785490","plan_out_hash":"8619fc5929ae0fda86bd022206af0fbcc70dc85e0bd3bd3ec59f15b233b47d8d","plan_hash":"809b3f5ddb772f41936100f54349e976c4c9f1b4c2fa2bbe3e9704df06edaf10","plan_text_format":"diff-trunc","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
environment       = "primary"
saml_metadata_url = (sensitive value)
```
</details>
<details>
<summary>Plan: 10 to add, 5 to change, 6 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # module.wildsea.aws_appsync_function.function["checkGameAccess"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/checkGameAccess/checkGameAccess.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var DDBPrefixGame = "GAME";
            
            // function/checkGameAccess/checkGameAccess.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const id = context.arguments.id;
              const key = {
                PK: DDBPrefixGame + "#" + id,
                SK: DDBPrefixGame
              };
              return {
                operation: "GetItem",
                key: util.dynamodb.toMapValues(key)
              };
            }
            function response(context) {
              if (context.error) {
                util.appendError(context.error.message, context.error.type, context.result);
                return;
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.appendError("Unauthorized: User ID is missing.");
                return;
              }
              if (!permitted(identity, context.result)) {
                util.appendError(
                  "Unauthorized: User does not have access to the game."
                );
                return;
              }
              return context.result;
            }
            function permitted(identity, data) {
              if (data === null) {
                return false;
              }
              if (data.fireflyUserId === identity.sub) {
                return true;
              }
              if (data.players) {
                for (const player of data.players) {
                  if (player === identity.sub) {
                    return true;
                  }
                }
              }
              return false;
            }
            export {
              permitted,
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiY2hlY2tHYW1lQWNjZXNzLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUEsU0FBUyxZQUE2Qzs7O0FDSy9DLElBQU0sZ0JBQWdCOzs7QURDdEIsU0FBUyxRQUNkLFNBQ3dCO0FBQ3hCLE1BQUksQ0FBQyxRQUFRLFVBQVU7QUFDckIsU0FBSyxNQUFNLGdEQUEwRDtBQUFBLEVBQ3ZFO0FBRUEsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFNBQVMsS0FBSztBQUNqQixTQUFLLE1BQU0sbUNBQTZDO0FBQUEsRUFDMUQ7QUFFQSxRQUFNLEtBQUssUUFBUSxVQUFVO0FBQzdCLFFBQU0sTUFBTTtBQUFBLElBQ1YsSUFBSSxnQkFBZ0IsTUFBTTtBQUFBLElBQzFCLElBQUk7QUFBQSxFQUNOO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsS0FBSyxLQUFLLFNBQVMsWUFBWSxHQUFHO0FBQUEsRUFDcEM7QUFDRjtBQVVPLFNBQVMsU0FBUyxTQUFnRDtBQUN2RSxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLFlBQVksUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQzFFO0FBQUEsRUFDRjtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxTQUFTLEtBQUs7QUFDakIsU0FBSyxZQUFZLG1DQUE2QztBQUM5RDtBQUFBLEVBQ0Y7QUFFQSxNQUFJLENBQUMsVUFBVSxVQUFVLFFBQVEsTUFBTSxHQUFHO0FBQ3hDLFNBQUs7QUFBQSxNQUNIO0FBQUEsSUFDRjtBQUNBO0FBQUEsRUFDRjtBQUVBLFNBQU8sUUFBUTtBQUNqQjtBQUVPLFNBQVMsVUFDZCxVQUNBLE1BQ1M7QUFDVCxNQUFJLFNBQVMsTUFBTTtBQUNqQixXQUFPO0FBQUEsRUFDVDtBQUVBLE1BQUksS0FBSyxrQkFBa0IsU0FBUyxLQUFLO0FBQ3ZDLFdBQU87QUFBQSxFQUNUO0FBRUEsTUFBSSxLQUFLLFNBQVM7QUFDaEIsZUFBVyxVQUFVLEtBQUssU0FBUztBQUNqQyxVQUFJLFdBQVcsU0FBUyxLQUFLO0FBQzNCLGVBQU87QUFBQSxNQUNUO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFFQSxTQUFPO0FBQ1Q7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "checkGameAccess"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_function.function["checkPlayerSheetAccess"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/checkPlayerSheetAccess/checkPlayerSheetAccess.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixPlayer = "PLAYER";
            
            // function/checkPlayerSheetAccess/checkPlayerSheetAccess.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const id = context.arguments.input.gameId;
              const key = {
                PK: DDBPrefixGame + "#" + id,
                SK: DDBPrefixPlayer + "#" + identity.sub
              };
              return {
                operation: "GetItem",
                key: util.dynamodb.toMapValues(key)
              };
            }
            function response(context) {
              if (context.error) {
                util.appendError(context.error.message, context.error.type, context.result);
                return;
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.appendError("Unauthorized: User ID is missing.");
                return;
              }
              if (identity.sub != context.result.userId) {
                util.appendError(
                  "Unauthorized: User does not have access to the player sheet."
                );
                return;
              }
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiY2hlY2tQbGF5ZXJTaGVldEFjY2Vzcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0svQyxJQUFNLGdCQUFnQjtBQUV0QixJQUFNLGtCQUFrQjs7O0FERHhCLFNBQVMsUUFDZCxTQUN3QjtBQUN4QixNQUFJLENBQUMsUUFBUSxVQUFVO0FBQ3JCLFNBQUssTUFBTSxnREFBMEQ7QUFBQSxFQUN2RTtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxTQUFTLEtBQUs7QUFDakIsU0FBSyxNQUFNLG1DQUE2QztBQUFBLEVBQzFEO0FBRUEsUUFBTSxLQUFLLFFBQVEsVUFBVSxNQUFNO0FBQ25DLFFBQU0sTUFBTTtBQUFBLElBQ1YsSUFBSSxnQkFBZ0IsTUFBTTtBQUFBLElBQzFCLElBQUksa0JBQWtCLE1BQU0sU0FBUztBQUFBLEVBQ3ZDO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsS0FBSyxLQUFLLFNBQVMsWUFBWSxHQUFHO0FBQUEsRUFDcEM7QUFDRjtBQVVPLFNBQVMsU0FDZCxTQUM2QjtBQUM3QixNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLFlBQVksUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQzFFO0FBQUEsRUFDRjtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxTQUFTLEtBQUs7QUFDakIsU0FBSyxZQUFZLG1DQUE2QztBQUM5RDtBQUFBLEVBQ0Y7QUFFQSxNQUFJLFNBQVMsT0FBTyxRQUFRLE9BQU8sUUFBUTtBQUN6QyxTQUFLO0FBQUEsTUFDSDtBQUFBLElBQ0Y7QUFDQTtBQUFBLEVBQ0Y7QUFFQSxTQUFPLFFBQVE7QUFDakI7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "checkPlayerSheetAccess"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_function.function["checkPlayerSheetAccessWithFirefly"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/checkPlayerSheetAccessWithFirefly/checkPlayerSheetAccessWithFirefly.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixPlayer = "PLAYER";
            
            // function/checkPlayerSheetAccessWithFirefly/checkPlayerSheetAccessWithFirefly.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const gameId = context.arguments.input.gameId;
              const userId = context.arguments.input.userId;
              const key = {
                PK: DDBPrefixGame + "#" + gameId,
                SK: DDBPrefixPlayer + "#" + userId
              };
              return {
                operation: "GetItem",
                key: util.dynamodb.toMapValues(key)
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              if (!context.result || identity.sub != context.result.userId && identity.sub != context.result.fireflyUserId) {
                util.error(
                  "Unauthorized: User does not have access to the player sheet."
                );
              }
              console.log(context.result);
              context.stash.userId = context.result.userId;
              context.stash.gameId = context.result.gameId;
              context.stash.fireflyUserId = context.result.fireflyUserId;
              context.stash.gameName = context.result.gameName;
              context.stash.gameDescription = context.result.gameDescription;
              context.stash.characterName = context.result.characterName;
              context.stash.createdAt = context.result.createdAt;
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiY2hlY2tQbGF5ZXJTaGVldEFjY2Vzc1dpdGhGaXJlZmx5LnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUEsU0FBUyxZQUE2Qzs7O0FDSy9DLElBQU0sZ0JBQWdCO0FBRXRCLElBQU0sa0JBQWtCOzs7QURFeEIsU0FBUyxRQUNkLFNBQ3dCO0FBQ3hCLE1BQUksQ0FBQyxRQUFRLFVBQVU7QUFDckIsU0FBSyxNQUFNLGdEQUEwRDtBQUFBLEVBQ3ZFO0FBRUEsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFNBQVMsS0FBSztBQUNqQixTQUFLLE1BQU0sbUNBQTZDO0FBQUEsRUFDMUQ7QUFFQSxRQUFNLFNBQVMsUUFBUSxVQUFVLE1BQU07QUFDdkMsUUFBTSxTQUFTLFFBQVEsVUFBVSxNQUFNO0FBQ3ZDLFFBQU0sTUFBTTtBQUFBLElBQ1YsSUFBSSxnQkFBZ0IsTUFBTTtBQUFBLElBQzFCLElBQUksa0JBQWtCLE1BQU07QUFBQSxFQUM5QjtBQUVBLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLEtBQUssS0FBSyxTQUFTLFlBQVksR0FBRztBQUFBLEVBQ3BDO0FBQ0Y7QUFVTyxTQUFTLFNBQ2QsU0FDNkI7QUFDN0IsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBRUEsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFNBQVMsS0FBSztBQUNqQixTQUFLLE1BQU0sbUNBQTZDO0FBQUEsRUFDMUQ7QUFFQSxNQUNFLENBQUMsUUFBUSxVQUNSLFNBQVMsT0FBTyxRQUFRLE9BQU8sVUFDOUIsU0FBUyxPQUFPLFFBQVEsT0FBTyxlQUNqQztBQUNBLFNBQUs7QUFBQSxNQUNIO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFFQSxVQUFRLElBQUksUUFBUSxNQUFNO0FBQzFCLFVBQVEsTUFBTSxTQUFTLFFBQVEsT0FBTztBQUN0QyxVQUFRLE1BQU0sU0FBUyxRQUFRLE9BQU87QUFDdEMsVUFBUSxNQUFNLGdCQUFnQixRQUFRLE9BQU87QUFDN0MsVUFBUSxNQUFNLFdBQVcsUUFBUSxPQUFPO0FBQ3hDLFVBQVEsTUFBTSxrQkFBa0IsUUFBUSxPQUFPO0FBQy9DLFVBQVEsTUFBTSxnQkFBZ0IsUUFBUSxPQUFPO0FBQzdDLFVBQVEsTUFBTSxZQUFZLFFBQVEsT0FBTztBQUV6QyxTQUFPLFFBQVE7QUFDakI7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "checkPlayerSheetAccessWithFirefly"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_function.function["createSection"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/createSection/createSection.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var TypeSection = "SECTION";
            var DDBPrefixGame = "GAME";
            var DDBPrefixSection = "SECTION";
            var DDBPrefixSectionUser = "SECTIONUSER";
            
            // function/createSection/createSection.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const input = context.arguments.input;
              const sectionId = util.autoId();
              const timestamp = util.time.nowISO8601();
              return {
                operation: "PutItem",
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixSection + "#" + sectionId
                }),
                attributeValues: util.dynamodb.toMapValues({
                  gameId: input.gameId,
                  userId: identity.sub,
                  sectionId,
                  sectionName: input.sectionName,
                  sectionType: input.sectionType,
                  GSI1PK: DDBPrefixSectionUser + "#" + identity.sub,
                  content: input.content,
                  position: input.position,
                  createdAt: timestamp,
                  updatedAt: timestamp,
                  type: TypeSection
                })
              };
            }
            function response(context) {
              if (context.error) {
                util.appendError(context.error.message, context.error.type, context.result);
                return null;
              }
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiY3JlYXRlU2VjdGlvbi50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0UvQyxJQUFNLGNBQWM7QUFHcEIsSUFBTSxnQkFBZ0I7QUFDdEIsSUFBTSxtQkFBbUI7QUFHekIsSUFBTSx1QkFBdUI7OztBREk3QixTQUFTLFFBQ2QsU0FDd0I7QUFDeEIsTUFBSSxDQUFDLFFBQVEsVUFBVTtBQUNyQixTQUFLLE1BQU0sZ0RBQTBEO0FBQUEsRUFDdkU7QUFFQSxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsU0FBUyxLQUFLO0FBQ2pCLFNBQUssTUFBTSxtQ0FBNkM7QUFBQSxFQUMxRDtBQUVBLFFBQU0sUUFBUSxRQUFRLFVBQVU7QUFDaEMsUUFBTSxZQUFZLEtBQUssT0FBTztBQUM5QixRQUFNLFlBQVksS0FBSyxLQUFLLFdBQVc7QUFFdkMsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsS0FBSyxLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQzdCLElBQUksZ0JBQWdCLE1BQU0sTUFBTTtBQUFBLE1BQ2hDLElBQUksbUJBQW1CLE1BQU07QUFBQSxJQUMvQixDQUFDO0FBQUEsSUFDRCxpQkFBaUIsS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUN6QyxRQUFRLE1BQU07QUFBQSxNQUNkLFFBQVEsU0FBUztBQUFBLE1BQ2pCO0FBQUEsTUFDQSxhQUFhLE1BQU07QUFBQSxNQUNuQixhQUFhLE1BQU07QUFBQSxNQUNuQixRQUFRLHVCQUF1QixNQUFNLFNBQVM7QUFBQSxNQUM5QyxTQUFTLE1BQU07QUFBQSxNQUNmLFVBQVUsTUFBTTtBQUFBLE1BQ2hCLFdBQVc7QUFBQSxNQUNYLFdBQVc7QUFBQSxNQUNYLE1BQU07QUFBQSxJQUNSLENBQUM7QUFBQSxFQUNIO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBK0I7QUFDdEQsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxZQUFZLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUMxRSxXQUFPO0FBQUEsRUFDVDtBQUNBLFNBQU8sUUFBUTtBQUNqQjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "createSection"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_function.function["deletePlayer"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/deletePlayer/deletePlayer.ts
            import { util } from "@aws-appsync/utils";
            
            // environment.json
            var environment_default = { name: "primary" };
            
            // lib/constants.ts
            var TypeCharacter = "CHARACTER";
            var DDBPrefixGame = "GAME";
            var DDBPrefixSection = "SECTION";
            var DDBPrefixPlayer = "PLAYER";
            
            // function/deletePlayer/deletePlayer.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              if (context.stash.userId == context.stash.fireflyUserId) {
                util.error("Cannot delete firefly sheet");
              }
              const sections = context.prev.result.items;
              const gameId = context.arguments.input.gameId;
              const userId = context.arguments.input.userId;
              const deleteSectionOps = sections.map((section) => ({
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + gameId,
                  SK: DDBPrefixSection + "#" + section.sectionId
                }),
                table: "Wildsea-" + environment_default.name,
                operation: "DeleteItem"
              }));
              const deletePlayerOp = {
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + gameId,
                  SK: DDBPrefixPlayer + "#" + userId
                }),
                table: "Wildsea-" + environment_default.name,
                operation: "DeleteItem"
              };
              const updateGameOp = {
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + gameId,
                  SK: DDBPrefixGame
                }),
                table: "Wildsea-" + environment_default.name,
                operation: "UpdateItem",
                update: {
                  expression: "DELETE players :userId",
                  expressionValues: {
                    ":userId": util.dynamodb.toStringSet([userId])
                  }
                }
              };
              const transactItems = [...deleteSectionOps, deletePlayerOp, updateGameOp];
              return {
                operation: "TransactWriteItems",
                transactItems
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type);
              }
              const timestamp = util.time.nowISO8601();
              return {
                gameId: context.arguments.input.gameId,
                userId: context.arguments.input.userId,
                characterName: context.stash.characterName,
                gameDescription: context.stash.gameDescription,
                gameName: context.stash.gameName,
                createdAt: context.stash.createdAt,
                updatedAt: timestamp,
                type: TypeCharacter,
                deleted: true
              };
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZGVsZXRlUGxheWVyLnRzIiwgIi4uLy4uL2Vudmlyb25tZW50Lmpzb24iLCAiLi4vLi4vbGliL2NvbnN0YW50cy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDOzs7QUNBdEQsNEJBQUMsTUFBTyxVQUFTOzs7QUNDVixJQUFNLGdCQUFnQjtBQUl0QixJQUFNLGdCQUFnQjtBQUN0QixJQUFNLG1CQUFtQjtBQUN6QixJQUFNLGtCQUFrQjs7O0FGT3hCLFNBQVMsUUFDZCxTQUNTO0FBQ1QsTUFBSSxDQUFDLFFBQVEsVUFBVTtBQUNyQixTQUFLLE1BQU0sZ0RBQWdEO0FBQUEsRUFDN0Q7QUFFQSxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsU0FBUyxLQUFLO0FBQ2pCLFNBQUssTUFBTSxtQ0FBbUM7QUFBQSxFQUNoRDtBQUVBLE1BQUksUUFBUSxNQUFNLFVBQVUsUUFBUSxNQUFNLGVBQWU7QUFDdkQsU0FBSyxNQUFNLDZCQUE2QjtBQUFBLEVBQzFDO0FBRUEsUUFBTSxXQUFXLFFBQVEsS0FBSyxPQUFPO0FBQ3JDLFFBQU0sU0FBUyxRQUFRLFVBQVUsTUFBTTtBQUN2QyxRQUFNLFNBQVMsUUFBUSxVQUFVLE1BQU07QUFHdkMsUUFBTSxtQkFBbUIsU0FBUyxJQUFJLENBQUMsYUFBYTtBQUFBLElBQ2xELEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNO0FBQUEsTUFDMUIsSUFBSSxtQkFBbUIsTUFBTSxRQUFRO0FBQUEsSUFDdkMsQ0FBQztBQUFBLElBQ0QsT0FBTyxhQUFhLG9CQUFZO0FBQUEsSUFDaEMsV0FBVztBQUFBLEVBQ2IsRUFBRTtBQUdGLFFBQU0saUJBQWlCO0FBQUEsSUFDckIsS0FBSyxLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQzdCLElBQUksZ0JBQWdCLE1BQU07QUFBQSxNQUMxQixJQUFJLGtCQUFrQixNQUFNO0FBQUEsSUFDOUIsQ0FBQztBQUFBLElBQ0QsT0FBTyxhQUFhLG9CQUFZO0FBQUEsSUFDaEMsV0FBVztBQUFBLEVBQ2I7QUFFQSxRQUFNLGVBQWU7QUFBQSxJQUNuQixLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxnQkFBZ0IsTUFBTTtBQUFBLE1BQzFCLElBQUk7QUFBQSxJQUNOLENBQUM7QUFBQSxJQUNELE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLFdBQVc7QUFBQSxJQUNYLFFBQVE7QUFBQSxNQUNOLFlBQVk7QUFBQSxNQUNaLGtCQUFrQjtBQUFBLFFBQ2hCLFdBQVcsS0FBSyxTQUFTLFlBQVksQ0FBQyxNQUFNLENBQUM7QUFBQSxNQUMvQztBQUFBLElBQ0Y7QUFBQSxFQUNGO0FBR0EsUUFBTSxnQkFBZ0IsQ0FBQyxHQUFHLGtCQUFrQixnQkFBZ0IsWUFBWTtBQUV4RSxTQUFPO0FBQUEsSUFDTCxXQUFXO0FBQUEsSUFDWDtBQUFBLEVBQ0Y7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUFzQztBQUM3RCxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLElBQUk7QUFBQSxFQUN0RDtBQUVBLFFBQU0sWUFBWSxLQUFLLEtBQUssV0FBVztBQUV2QyxTQUFPO0FBQUEsSUFDTCxRQUFRLFFBQVEsVUFBVSxNQUFNO0FBQUEsSUFDaEMsUUFBUSxRQUFRLFVBQVUsTUFBTTtBQUFBLElBQ2hDLGVBQWUsUUFBUSxNQUFNO0FBQUEsSUFDN0IsaUJBQWlCLFFBQVEsTUFBTTtBQUFBLElBQy9CLFVBQVUsUUFBUSxNQUFNO0FBQUEsSUFDeEIsV0FBVyxRQUFRLE1BQU07QUFBQSxJQUN6QixXQUFXO0FBQUEsSUFDWCxNQUFNO0FBQUEsSUFDTixTQUFTO0FBQUEsRUFDWDtBQUNGOyIsCiAgIm5hbWVzIjogW10KfQo=
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "deletePlayer"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_function.function["findAllSections"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/findAllSections/findAllSections.ts
            import {
              util
            } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixSectionUser = "SECTIONUSER";
            
            // function/findAllSections/findAllSections.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const input = context.arguments.input;
              const { gameId, userId } = input;
              return {
                operation: "Query",
                index: "GSI1",
                query: {
                  expression: "#GSI1PK = :gsi1pk AND #PK = :pk",
                  expressionNames: {
                    "#GSI1PK": "GSI1PK",
                    "#PK": "PK"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":gsi1pk": DDBPrefixSectionUser + "#" + userId,
                    ":pk": DDBPrefixGame + "#" + gameId
                  })
                },
                projection: {
                  expression: "#sectionId",
                  expressionNames: { "#sectionId": "sectionId" }
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type);
              }
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZmluZEFsbFNlY3Rpb25zLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUE7QUFBQSxFQUNFO0FBQUEsT0FJSzs7O0FDQUEsSUFBTSxnQkFBZ0I7QUFJdEIsSUFBTSx1QkFBdUI7OztBREE3QixTQUFTLFFBQ2QsU0FDc0I7QUFDdEIsTUFBSSxDQUFDLFFBQVEsVUFBVTtBQUNyQixTQUFLLE1BQU0sZ0RBQWdEO0FBQUEsRUFDN0Q7QUFFQSxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsU0FBUyxLQUFLO0FBQ2pCLFNBQUssTUFBTSxtQ0FBbUM7QUFBQSxFQUNoRDtBQUVBLFFBQU0sUUFBUSxRQUFRLFVBQVU7QUFDaEMsUUFBTSxFQUFFLFFBQVEsT0FBTyxJQUFJO0FBRzNCLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLE9BQU87QUFBQSxJQUNQLE9BQU87QUFBQSxNQUNMLFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsV0FBVztBQUFBLFFBQ1gsT0FBTztBQUFBLE1BQ1Q7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLFdBQVcsdUJBQXVCLE1BQU07QUFBQSxRQUN4QyxPQUFPLGdCQUFnQixNQUFNO0FBQUEsTUFDL0IsQ0FBQztBQUFBLElBQ0g7QUFBQSxJQUNBLFlBQVk7QUFBQSxNQUNWLFlBQVk7QUFBQSxNQUNaLGlCQUFpQixFQUFFLGNBQWMsWUFBWTtBQUFBLElBQy9DO0FBQUEsRUFDRjtBQUNGO0FBRU8sU0FBUyxTQUFTLFNBQTJCO0FBQ2xELE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssTUFBTSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sSUFBSTtBQUFBLEVBQ3REO0FBRUEsU0FBTyxRQUFRO0FBQ2pCOyIsCiAgIm5hbWVzIjogW10KfQo=
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "findAllSections"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_function.function["fnCheckGameAccess"] will be destroyed
  # (because key ["fnCheckGameAccess"] is not in for_each map)
-   resource "aws_appsync_function" "function" {
-       api_id                    = "tfiz6mnf2nhyzpzkwm554sir5q" -> null
-       arn                       = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/functions/bruez62wevgorcsrapfl7prw3q" -> null
-       code                      = <<-EOT
            // function/fnCheckGameAccess/checkGameAccess.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var DDBPrefixGame = "GAME";
            
            // function/fnCheckGameAccess/checkGameAccess.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const id = context.arguments.id;
              const key = {
                PK: DDBPrefixGame + "#" + id,
                SK: DDBPrefixGame
              };
              return {
                operation: "GetItem",
                key: util.dynamodb.toMapValues(key)
              };
            }
            function response(context) {
              if (context.error) {
                util.appendError(context.error.message, context.error.type, context.result);
                return;
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.appendError("Unauthorized: User ID is missing.");
                return;
              }
              if (!permitted(identity, context.result)) {
                util.appendError(
                  "Unauthorized: User does not have access to the game."
                );
                return;
              }
              return context.result;
            }
            function permitted(identity, data) {
              if (data === null) {
                return false;
              }
              if (data.fireflyUserId === identity.sub) {
                return true;
              }
              if (data.players) {
                for (const player of data.players) {
                  if (player === identity.sub) {
                    return true;
                  }
                }
              }
              return false;
            }
            export {
              permitted,
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiY2hlY2tHYW1lQWNjZXNzLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUEsU0FBUyxZQUE2Qzs7O0FDSy9DLElBQU0sZ0JBQWdCOzs7QURDdEIsU0FBUyxRQUNkLFNBQ3dCO0FBQ3hCLE1BQUksQ0FBQyxRQUFRLFVBQVU7QUFDckIsU0FBSyxNQUFNLGdEQUEwRDtBQUFBLEVBQ3ZFO0FBRUEsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFNBQVMsS0FBSztBQUNqQixTQUFLLE1BQU0sbUNBQTZDO0FBQUEsRUFDMUQ7QUFFQSxRQUFNLEtBQUssUUFBUSxVQUFVO0FBQzdCLFFBQU0sTUFBTTtBQUFBLElBQ1YsSUFBSSxnQkFBZ0IsTUFBTTtBQUFBLElBQzFCLElBQUk7QUFBQSxFQUNOO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsS0FBSyxLQUFLLFNBQVMsWUFBWSxHQUFHO0FBQUEsRUFDcEM7QUFDRjtBQVVPLFNBQVMsU0FBUyxTQUFnRDtBQUN2RSxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLFlBQVksUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQzFFO0FBQUEsRUFDRjtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxTQUFTLEtBQUs7QUFDakIsU0FBSyxZQUFZLG1DQUE2QztBQUM5RDtBQUFBLEVBQ0Y7QUFFQSxNQUFJLENBQUMsVUFBVSxVQUFVLFFBQVEsTUFBTSxHQUFHO0FBQ3hDLFNBQUs7QUFBQSxNQUNIO0FBQUEsSUFDRjtBQUNBO0FBQUEsRUFDRjtBQUVBLFNBQU8sUUFBUTtBQUNqQjtBQUVPLFNBQVMsVUFDZCxVQUNBLE1BQ1M7QUFDVCxNQUFJLFNBQVMsTUFBTTtBQUNqQixXQUFPO0FBQUEsRUFDVDtBQUVBLE1BQUksS0FBSyxrQkFBa0IsU0FBUyxLQUFLO0FBQ3ZDLFdBQU87QUFBQSxFQUNUO0FBRUEsTUFBSSxLQUFLLFNBQVM7QUFDaEIsZUFBVyxVQUFVLEtBQUssU0FBUztBQUNqQyxVQUFJLFdBQVcsU0FBUyxLQUFLO0FBQzNCLGVBQU87QUFBQSxNQUNUO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFFQSxTQUFPO0FBQ1Q7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT -> null
-       data_source               = "Wildsea_primary" -> null
-       function_id               = "bruez62wevgorcsrapfl7prw3q" -> null
-       id                        = "tfiz6mnf2nhyzpzkwm554sir5q-bruez62wevgorcsrapfl7prw3q" -> null
-       max_batch_size            = 0 -> null
-       name                      = "fnCheckGameAccess" -> null
#        (4 unchanged attributes hidden)

-       runtime {
-           name            = "APPSYNC_JS" -> null
-           runtime_version = "1.0.0" -> null
        }
    }

  # module.wildsea.aws_appsync_function.function["fnCheckPlayerSheetAccess"] will be destroyed
  # (because key ["fnCheckPlayerSheetAccess"] is not in for_each map)
-   resource "aws_appsync_function" "function" {
-       api_id                    = "tfiz6mnf2nhyzpzkwm554sir5q" -> null
-       arn                       = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/functions/zdmamhvzizempgpjrlvqjwxide" -> null
-       code                      = <<-EOT
            // function/fnCheckPlayerSheetAccess/checkPlayerSheetAccess.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixPlayer = "PLAYER";
            
            // function/fnCheckPlayerSheetAccess/checkPlayerSheetAccess.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const id = context.arguments.input.gameId;
              const key = {
                PK: DDBPrefixGame + "#" + id,
                SK: DDBPrefixPlayer + "#" + identity.sub
              };
              return {
                operation: "GetItem",
                key: util.dynamodb.toMapValues(key)
              };
            }
            function response(context) {
              if (context.error) {
                util.appendError(context.error.message, context.error.type, context.result);
                return;
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.appendError("Unauthorized: User ID is missing.");
                return;
              }
              if (identity.sub != context.result.userId) {
                util.appendError(
                  "Unauthorized: User does not have access to the player sheet."
                );
                return;
              }
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiY2hlY2tQbGF5ZXJTaGVldEFjY2Vzcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0svQyxJQUFNLGdCQUFnQjtBQUV0QixJQUFNLGtCQUFrQjs7O0FERHhCLFNBQVMsUUFDZCxTQUN3QjtBQUN4QixNQUFJLENBQUMsUUFBUSxVQUFVO0FBQ3JCLFNBQUssTUFBTSxnREFBMEQ7QUFBQSxFQUN2RTtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxTQUFTLEtBQUs7QUFDakIsU0FBSyxNQUFNLG1DQUE2QztBQUFBLEVBQzFEO0FBRUEsUUFBTSxLQUFLLFFBQVEsVUFBVSxNQUFNO0FBQ25DLFFBQU0sTUFBTTtBQUFBLElBQ1YsSUFBSSxnQkFBZ0IsTUFBTTtBQUFBLElBQzFCLElBQUksa0JBQWtCLE1BQU0sU0FBUztBQUFBLEVBQ3ZDO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsS0FBSyxLQUFLLFNBQVMsWUFBWSxHQUFHO0FBQUEsRUFDcEM7QUFDRjtBQVVPLFNBQVMsU0FDZCxTQUM2QjtBQUM3QixNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLFlBQVksUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQzFFO0FBQUEsRUFDRjtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxTQUFTLEtBQUs7QUFDakIsU0FBSyxZQUFZLG1DQUE2QztBQUM5RDtBQUFBLEVBQ0Y7QUFFQSxNQUFJLFNBQVMsT0FBTyxRQUFRLE9BQU8sUUFBUTtBQUN6QyxTQUFLO0FBQUEsTUFDSDtBQUFBLElBQ0Y7QUFDQTtBQUFBLEVBQ0Y7QUFFQSxTQUFPLFFBQVE7QUFDakI7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT -> null
-       data_source               = "Wildsea_primary" -> null
-       function_id               = "zdmamhvzizempgpjrlvqjwxide" -> null
-       id                        = "tfiz6mnf2nhyzpzkwm554sir5q-zdmamhvzizempgpjrlvqjwxide" -> null
-       max_batch_size            = 0 -> null
-       name                      = "fnCheckPlayerSheetAccess" -> null
#        (4 unchanged attributes hidden)

-       runtime {
-           name            = "APPSYNC_JS" -> null
-           runtime_version = "1.0.0" -> null
        }
    }

  # module.wildsea.aws_appsync_function.function["fnCreateSection"] will be destroyed
  # (because key ["fnCreateSection"] is not in for_each map)
-   resource "aws_appsync_function" "function" {
-       api_id                    = "tfiz6mnf2nhyzpzkwm554sir5q" -> null
-       arn                       = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/functions/62xsdeifgreozetsjjwoxnbm4q" -> null
-       code                      = <<-EOT
            // function/fnCreateSection/createSection.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var TypeSection = "SECTION";
            var DDBPrefixGame = "GAME";
            var DDBPrefixSection = "SECTION";
            
            // function/fnCreateSection/createSection.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const input = context.arguments.input;
              const sectionId = util.autoId();
              const timestamp = util.time.nowISO8601();
              return {
                operation: "PutItem",
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixSection + "#" + sectionId
                }),
                attributeValues: util.dynamodb.toMapValues({
                  gameId: input.gameId,
                  userId: identity.sub,
                  sectionId,
                  sectionName: input.sectionName,
                  sectionType: input.sectionType,
                  content: input.content,
                  position: input.position,
                  createdAt: timestamp,
                  updatedAt: timestamp,
                  type: TypeSection
                })
              };
            }
            function response(context) {
              if (context.error) {
                util.appendError(context.error.message, context.error.type, context.result);
                return null;
              }
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiY3JlYXRlU2VjdGlvbi50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0UvQyxJQUFNLGNBQWM7QUFHcEIsSUFBTSxnQkFBZ0I7QUFDdEIsSUFBTSxtQkFBbUI7OztBRE16QixTQUFTLFFBQ2QsU0FDd0I7QUFDeEIsTUFBSSxDQUFDLFFBQVEsVUFBVTtBQUNyQixTQUFLLE1BQU0sZ0RBQTBEO0FBQUEsRUFDdkU7QUFFQSxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsU0FBUyxLQUFLO0FBQ2pCLFNBQUssTUFBTSxtQ0FBNkM7QUFBQSxFQUMxRDtBQUVBLFFBQU0sUUFBUSxRQUFRLFVBQVU7QUFDaEMsUUFBTSxZQUFZLEtBQUssT0FBTztBQUM5QixRQUFNLFlBQVksS0FBSyxLQUFLLFdBQVc7QUFFdkMsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsS0FBSyxLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQzdCLElBQUksZ0JBQWdCLE1BQU0sTUFBTTtBQUFBLE1BQ2hDLElBQUksbUJBQW1CLE1BQU07QUFBQSxJQUMvQixDQUFDO0FBQUEsSUFDRCxpQkFBaUIsS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUN6QyxRQUFRLE1BQU07QUFBQSxNQUNkLFFBQVEsU0FBUztBQUFBLE1BQ2pCO0FBQUEsTUFDQSxhQUFhLE1BQU07QUFBQSxNQUNuQixhQUFhLE1BQU07QUFBQSxNQUNuQixTQUFTLE1BQU07QUFBQSxNQUNmLFVBQVUsTUFBTTtBQUFBLE1BQ2hCLFdBQVc7QUFBQSxNQUNYLFdBQVc7QUFBQSxNQUNYLE1BQU07QUFBQSxJQUNSLENBQUM7QUFBQSxFQUNIO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBK0I7QUFDdEQsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxZQUFZLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUMxRSxXQUFPO0FBQUEsRUFDVDtBQUNBLFNBQU8sUUFBUTtBQUNqQjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT -> null
-       data_source               = "Wildsea_primary" -> null
-       function_id               = "62xsdeifgreozetsjjwoxnbm4q" -> null
-       id                        = "tfiz6mnf2nhyzpzkwm554sir5q-62xsdeifgreozetsjjwoxnbm4q" -> null
-       max_batch_size            = 0 -> null
-       name                      = "fnCreateSection" -> null
#        (4 unchanged attributes hidden)

-       runtime {
-           name            = "APPSYNC_JS" -> null
-           runtime_version = "1.0.0" -> null
        }
    }

  # module.wildsea.aws_appsync_function.function["fnGetGame"] will be destroyed
  # (because key ["fnGetGame"] is not in for_each map)
-   resource "aws_appsync_function" "function" {
-       api_id                    = "tfiz6mnf2nhyzpzkwm554sir5q" -> null
-       arn                       = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/functions/hucksk5h3rd3xeo46lxty2trwa" -> null
-       code                      = <<-EOT
            // function/fnGetGame/getGame.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var TypeGame = "GAME";
            var TypeCharacter = "CHARACTER";
            var TypeSection = "SECTION";
            var TypeFirefly = "FIREFLY";
            var DDBPrefixGame = "GAME";
            
            // function/fnGetGame/getGame.ts
            function request(context) {
              validateIdentity(context);
              return buildDynamoDBQuery(context.arguments.id);
            }
            function validateIdentity(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
            }
            function buildDynamoDBQuery(id) {
              const pk = DDBPrefixGame + "#" + id;
              const expr = {
                expression: "#pk = :pk",
                expressionNames: {
                  "#pk": "PK"
                },
                expressionValues: {
                  ":pk": { S: pk }
                }
              };
              return {
                operation: "Query",
                query: expr
              };
            }
            function response(context) {
              validateResponse(context);
              validateIdentity(context);
              const identity = context.identity;
              const sheets = buildPlayerSheets(context.result.items);
              const game = findAndBuildGame(context.result.items, identity.sub);
              addSheetsToGame(game, sheets);
              return game;
            }
            function validateResponse(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              if (!context.result?.items?.length) {
                util.error("Game not found");
              }
            }
            function buildPlayerSheets(items) {
              const sheets = {};
              items.forEach((data) => {
                if (data.type === TypeCharacter || data.type === TypeFirefly) {
                  const sheet = makeCharacterSheetData(data);
                  sheets[sheet.userId] = sheet;
                } else if (data.type === TypeSection) {
                  addSectionToSheet(sheets, data);
                } else if (data.type != TypeGame) {
                  util.error("Unknown type: " + data.type);
                }
              });
              return sheets;
            }
            function addSectionToSheet(sheets, data) {
              const section = makeSheetSection(data);
              const sheet = sheets[section.userId];
              if (sheet === void 0) {
                util.error("Sheet not found");
              }
              sheet.sections.push(section);
            }
            function findAndBuildGame(items, sub) {
              const gameData = items.find((data) => data.type === TypeGame);
              if (!gameData) {
                util.error("Game record not found");
              }
              return makeGameData(gameData, sub);
            }
            function addSheetsToGame(game, sheets) {
              const userIds = Object.keys(sheets).sort();
              userIds.forEach((userId) => {
                game.playerSheets.push(sheets[userId]);
              });
            }
            function makeGameData(data, sub) {
              let joinToken = null;
              if (data.fireflyUserId == sub) {
                joinToken = data.joinToken;
              }
              return {
                gameId: data.gameId,
                gameName: data.gameName,
                gameDescription: data.gameDescription,
                playerSheets: [],
                joinToken,
                createdAt: data.createdAt,
                updatedAt: data.updatedAt,
                type: data.type
              };
            }
            function makeCharacterSheetData(data) {
              return {
                userId: data.userId,
                gameId: data.gameId,
                characterName: data.characterName,
                createdAt: data.createdAt,
                updatedAt: data.updatedAt,
                type: data.type,
                sections: []
              };
            }
            function makeSheetSection(data) {
              return {
                userId: data.userId,
                gameId: data.gameId,
                sectionId: data.sectionId,
                sectionName: data.sectionName,
                sectionType: data.sectionType,
                content: data.content,
                position: data.position,
                createdAt: data.createdAt,
                updatedAt: data.updatedAt,
                type: data.type
              };
            }
            export {
              makeCharacterSheetData,
              makeGameData,
              makeSheetSection,
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZ2V0R2FtZS50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0EvQyxJQUFNLFdBQVc7QUFDakIsSUFBTSxnQkFBZ0I7QUFDdEIsSUFBTSxjQUFjO0FBQ3BCLElBQU0sY0FBYztBQUVwQixJQUFNLGdCQUFnQjs7O0FEb0J0QixTQUFTLFFBQ2QsU0FDc0I7QUFDdEIsbUJBQWlCLE9BQU87QUFDeEIsU0FBTyxtQkFBbUIsUUFBUSxVQUFVLEVBQUU7QUFDaEQ7QUFFQSxTQUFTLGlCQUFpQixTQUEwQztBQUNsRSxNQUFJLENBQUMsUUFBUSxVQUFVO0FBQ3JCLFNBQUssTUFBTSxnREFBMEQ7QUFBQSxFQUN2RTtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxTQUFTLEtBQUs7QUFDakIsU0FBSyxNQUFNLG1DQUE2QztBQUFBLEVBQzFEO0FBQ0Y7QUFFQSxTQUFTLG1CQUFtQixJQUFrQztBQUM1RCxRQUFNLEtBQUssZ0JBQWdCLE1BQU07QUFDakMsUUFBTSxPQUEyQjtBQUFBLElBQy9CLFlBQVk7QUFBQSxJQUNaLGlCQUFpQjtBQUFBLE1BQ2YsT0FBTztBQUFBLElBQ1Q7QUFBQSxJQUNBLGtCQUFrQjtBQUFBLE1BQ2hCLE9BQU8sRUFBRSxHQUFHLEdBQUc7QUFBQSxJQUNqQjtBQUFBLEVBQ0Y7QUFDQSxTQUFPO0FBQUEsSUFDTCxXQUFXO0FBQUEsSUFDWCxPQUFPO0FBQUEsRUFDVDtBQUNGO0FBVU8sU0FBUyxTQUFTLFNBQTRDO0FBQ25FLG1CQUFpQixPQUFPO0FBQ3hCLG1CQUFpQixPQUFPO0FBRXhCLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLFFBQU0sU0FBUyxrQkFBa0IsUUFBUSxPQUFPLEtBQUs7QUFDckQsUUFBTSxPQUFPLGlCQUFpQixRQUFRLE9BQU8sT0FBTyxTQUFTLEdBQUc7QUFFaEUsa0JBQWdCLE1BQU0sTUFBTTtBQUM1QixTQUFPO0FBQ1Q7QUFFQSxTQUFTLGlCQUFpQixTQUFnQztBQUN4RCxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQUEsRUFDdEU7QUFFQSxNQUFJLENBQUMsUUFBUSxRQUFRLE9BQU8sUUFBUTtBQUNsQyxTQUFLLE1BQU0sZ0JBQWdCO0FBQUEsRUFDN0I7QUFDRjtBQUVBLFNBQVMsa0JBQWtCLE9BQTRDO0FBQ3JFLFFBQU0sU0FBc0MsQ0FBQztBQUM3QyxRQUFNLFFBQVEsQ0FBQyxTQUFTO0FBQ3RCLFFBQUksS0FBSyxTQUFTLGlCQUFpQixLQUFLLFNBQVMsYUFBYTtBQUM1RCxZQUFNLFFBQVEsdUJBQXVCLElBQXVCO0FBQzVELGFBQU8sTUFBTSxNQUFNLElBQUk7QUFBQSxJQUN6QixXQUFXLEtBQUssU0FBUyxhQUFhO0FBQ3BDLHdCQUFrQixRQUFRLElBQXdCO0FBQUEsSUFDcEQsV0FBVyxLQUFLLFFBQVEsVUFBVTtBQUNoQyxXQUFLLE1BQU0sbUJBQW1CLEtBQUssSUFBSTtBQUFBLElBQ3pDO0FBQUEsRUFDRixDQUFDO0FBQ0QsU0FBTztBQUNUO0FBRUEsU0FBUyxrQkFDUCxRQUNBLE1BQ007QUFDTixRQUFNLFVBQVUsaUJBQWlCLElBQUk7QUFDckMsUUFBTSxRQUFRLE9BQU8sUUFBUSxNQUFNO0FBQ25DLE1BQUksVUFBVSxRQUFXO0FBQ3ZCLFNBQUssTUFBTSxpQkFBaUI7QUFBQSxFQUM5QjtBQUNBLFFBQU0sU0FBUyxLQUFLLE9BQU87QUFDN0I7QUFFQSxTQUFTLGlCQUFpQixPQUFlLEtBQW1CO0FBQzFELFFBQU0sV0FBVyxNQUFNLEtBQUssQ0FBQyxTQUFTLEtBQUssU0FBUyxRQUFRO0FBQzVELE1BQUksQ0FBQyxVQUFVO0FBQ2IsU0FBSyxNQUFNLHVCQUF1QjtBQUFBLEVBQ3BDO0FBQ0EsU0FBTyxhQUFhLFVBQVUsR0FBRztBQUNuQztBQUVBLFNBQVMsZ0JBQ1AsTUFDQSxRQUNNO0FBQ04sUUFBTSxVQUFVLE9BQU8sS0FBSyxNQUFNLEVBQUUsS0FBSztBQUN6QyxVQUFRLFFBQVEsQ0FBQyxXQUFXO0FBQzFCLFNBQUssYUFBYSxLQUFLLE9BQU8sTUFBTSxDQUFDO0FBQUEsRUFDdkMsQ0FBQztBQUNIO0FBRU8sU0FBUyxhQUFhLE1BQWdCLEtBQW1CO0FBQzlELE1BQUksWUFBWTtBQUNoQixNQUFJLEtBQUssaUJBQWlCLEtBQUs7QUFDN0IsZ0JBQVksS0FBSztBQUFBLEVBQ25CO0FBQ0EsU0FBTztBQUFBLElBQ0wsUUFBUSxLQUFLO0FBQUEsSUFDYixVQUFVLEtBQUs7QUFBQSxJQUNmLGlCQUFpQixLQUFLO0FBQUEsSUFDdEIsY0FBYyxDQUFDO0FBQUEsSUFDZjtBQUFBLElBQ0EsV0FBVyxLQUFLO0FBQUEsSUFDaEIsV0FBVyxLQUFLO0FBQUEsSUFDaEIsTUFBTSxLQUFLO0FBQUEsRUFDYjtBQUNGO0FBRU8sU0FBUyx1QkFBdUIsTUFBb0M7QUFDekUsU0FBTztBQUFBLElBQ0wsUUFBUSxLQUFLO0FBQUEsSUFDYixRQUFRLEtBQUs7QUFBQSxJQUNiLGVBQWUsS0FBSztBQUFBLElBQ3BCLFdBQVcsS0FBSztBQUFBLElBQ2hCLFdBQVcsS0FBSztBQUFBLElBQ2hCLE1BQU0sS0FBSztBQUFBLElBQ1gsVUFBVSxDQUFDO0FBQUEsRUFDYjtBQUNGO0FBRU8sU0FBUyxpQkFBaUIsTUFBc0M7QUFDckUsU0FBTztBQUFBLElBQ0wsUUFBUSxLQUFLO0FBQUEsSUFDYixRQUFRLEtBQUs7QUFBQSxJQUNiLFdBQVcsS0FBSztBQUFBLElBQ2hCLGFBQWEsS0FBSztBQUFBLElBQ2xCLGFBQWEsS0FBSztBQUFBLElBQ2xCLFNBQVMsS0FBSztBQUFBLElBQ2QsVUFBVSxLQUFLO0FBQUEsSUFDZixXQUFXLEtBQUs7QUFBQSxJQUNoQixXQUFXLEtBQUs7QUFBQSxJQUNoQixNQUFNLEtBQUs7QUFBQSxFQUNiO0FBQ0Y7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT -> null
-       data_source               = "Wildsea_primary" -> null
-       function_id               = "hucksk5h3rd3xeo46lxty2trwa" -> null
-       id                        = "tfiz6mnf2nhyzpzkwm554sir5q-hucksk5h3rd3xeo46lxty2trwa" -> null
-       max_batch_size            = 0 -> null
-       name                      = "fnGetGame" -> null
#        (4 unchanged attributes hidden)

-       runtime {
-           name            = "APPSYNC_JS" -> null
-           runtime_version = "1.0.0" -> null
        }
    }

  # module.wildsea.aws_appsync_function.function["fnGetGameWithToken"] will be destroyed
  # (because key ["fnGetGameWithToken"] is not in for_each map)
-   resource "aws_appsync_function" "function" {
-       api_id                    = "tfiz6mnf2nhyzpzkwm554sir5q" -> null
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Environment Main - Plan #318](https://github.com/jarrod-lowe/wildsea/actions/runs/11089785490)